---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.FabricLocation.BottomOrInternal
enum: Autodesk.Revit.DB.Structure.FabricLocation
source: html/965ab895-2f32-baaa-b065-d9cc4f359357.htm
---
# Autodesk.Revit.DB.Structure.FabricLocation.BottomOrInternal

The fabric is on the bottom face of a floor host, or on the internal face of a wall host.